yeswanth3399/EnviroTime-ARM_LPC2148-RTC/flash.c
// flash.c

#include <LPC21xx.h>
#include <string.h>

#include "flash.h"
#include "types.h"

#define IAP_LOCATION 0x7FFFFFF1


/*LPC2148 stores built-in flash programming functions inside internal ROM.

These ROM functions are called:

IAP routines
In-Application Programming routines

The ROM function exists at fixed address:

#define IAP_LOCATION 0x7FFFFFF1

This address contains internal NXP ROM flash programming code.

To execute that ROM function,
we must call it using a function pointer.
*/

typedef void (*IAP)(unsigned int[], unsigned int[]);

/*FUNCTION POINTER CREATION
IAP iap_entry = (IAP)IAP_LOCATION;

Explanation:

IAP ? function pointer datatype
iap_entry ? function pointer variable
IAP_LOCATION ? ROM function address

This statement means:

iap_entry now points to LPC2148 internal ROM IAP function
VISUAL REPRESENTATION
iap_entry
    |
    |-----> 0x7FFFFFF1
                  |
                  |
            LPC2148 ROM
            IAP FUNCTIONS
*/

static IAP iap = (IAP)IAP_LOCATION;

// Last sector of LPC2148
#define FLASH_SECTOR	14
#define FLASH_ADDR		0x0003C000

#define CCLK_KHZ       60000

// IAP Status Codes
#define CMD_SUCCESS    0

typedef struct
{
    u8  pass[8];

    u32 checksum;

    u8  dummy[244];

}flash_t;

// ----------------------------------------------------
// Checksum function
// ----------------------------------------------------

static u32 cs(char *p)
{
    u32 s = 0;

    s32 i;

    for(i=0; i<8; i++)
    {
        s += p[i];
    }

    return s;
}

// ----------------------------------------------------
// Write Password into Flash
// ----------------------------------------------------

void flash_write_password(char *p)
{
    u32 cmd[5];
    u32 res[5];

    // 256-byte aligned RAM buffer
    __align(256) static flash_t data;

    // Clear structure
    memset(&data,0,sizeof(data));

    // Copy password
    strncpy((char*)data.pass,p,7);

    data.pass[7] = '\0';

    // Generate checksum
    data.checksum = cs((char*)data.pass);

    // Disable IRQ during IAP
    __disable_irq();

    // Disable MAM (important in Proteus sometimes)
    MAMCR = 0;

    // --------------------------------------------
    // PREPARE SECTOR
    // --------------------------------------------

    cmd[0] = 50;
    cmd[1] = FLASH_SECTOR;
    cmd[2] = FLASH_SECTOR;

    iap(cmd,res);

    if(res[0] != CMD_SUCCESS)
        goto exit;

    // --------------------------------------------
    // ERASE SECTOR
    // --------------------------------------------

    cmd[0] = 52;
    cmd[1] = FLASH_SECTOR;
    cmd[2] = FLASH_SECTOR;
    cmd[3] = CCLK_KHZ;

    iap(cmd,res);

    if(res[0] != CMD_SUCCESS)
        goto exit;

    // --------------------------------------------
    // PREPARE AGAIN
    // --------------------------------------------

    cmd[0] = 50;
    cmd[1] = FLASH_SECTOR;
    cmd[2] = FLASH_SECTOR;

    iap(cmd,res);

    if(res[0] != CMD_SUCCESS)
        goto exit;

    // --------------------------------------------
    // COPY RAM TO FLASH
    // --------------------------------------------

    cmd[0] = 51;

    cmd[1] = FLASH_ADDR;

    cmd[2] = (u32)&data;

    cmd[3] = 256;

    cmd[4] = CCLK_KHZ;

    iap(cmd,res);

exit:

    // Enable MAM again
    MAMCR = 2;

    // Enable interrupts
    __enable_irq();
}

// ----------------------------------------------------
// Read Password from Flash
// ----------------------------------------------------

void flash_read_password(char *dest)
{
    flash_t *p = (flash_t*)FLASH_ADDR;

    // Empty flash condition
    if((u8)p->pass[0] == 0xFF)
    {
        strcpy(dest,"1234");

        return;
    }

    // Verify checksum
    if(p->checksum == cs((char*)p->pass))
    {
        strncpy(dest,(char*)p->pass,7);

        dest[7] = '\0';
    }
    else
    {
        strcpy(dest,"1234");
    }
}
